Revit 2027 API
NurbsSurfaceData.IsValid Method
 Check if the object contains a valid NurbsSurfaceData.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValid()
Public Function IsValid As Boolean
public:
bool IsValid()
member IsValid : unit -> bool
Return Value
Boolean
 True if it is a valid NurbsSurfaceData, false otherwise.
See Also
Reference
NurbsSurfaceData Class
Autodesk.Revit.DB Namespace